# FilterStringContains Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterStringContains Constructor
FilterStringContains Class See Also
---
Constructs an instance of FilterStringContains.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FilterStringContains()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
FilterStringContains()
```

# See Also
FilterStringContains Class
Autodesk.Revit.DB Namespace